<?php

//1 задача

/*for($i=5; $i<14; $i++){
    echo $i . "<br>";
}

//2 задача while

/*
$num = 1000;
while($num>50){
    echo $num . "<br>";
    $num = $num/2;
}*/

//2 задача for

/*
for($num = 1000; $num>50; ){
    $num = $num / 2;
    echo $num . "<br>";
}*/

//1. 1000/2=500
//2. 500/2=250
//3. 250/2=125
//4. 125/2=62,5
//5. 62,5/2=31,25

//число 31,25

//количество итераций 5

//3 задача
/*
$i = 2;
$v = 10 - $i;
while($i++ < $v){
    echo $i . ",";
}*/

/*
$i = 10;
for($g = 0; $g <= 10 - $i; $g++){
    echo $g . ",";
}*/

//Сдайд 23 задача 1

for($i = 0; $i < 31; $i++){
    if($i % 2 == 0){
        echo $i . '<br>';
    }
}

//Слайд 23 задача 2

/*
for($i = 1; $i < 51; $i++){
    if($i % 3 == 0 and $i % 5 == 0)
        echo '<b>' . $i . '</b>' . ' ';
    elseif($i % 3 == 0)
        echo '<i>' . $i . '</i>' . ' ';
}*/

//Слайд 24 задача 1 не работает

/*
$a = array(4, 8, 5, 9, 5, 9, 4);
for($i = 0; $i<7; $i++){
    if($i % 2==0) {
        echo array_sum($i);
    }
}*/